Revit 2027 API
Group.IsAttached Property
 Indicates wether or not this group is attached to a parent group.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsAttached { get; }
Public ReadOnly Property IsAttached As Boolean
	Get
public:
property bool IsAttached {
	bool get ();
}
member IsAttached : bool with get
Property Value
Boolean
See Also
Reference
Group Class
Autodesk.Revit.DB Namespace